[
  {
    "path": "posts/2024-05-23-japan-taiwan-2024/",
    "title": "Japan & Taiwan 2024",
    "description": "Casual trips to Japan and Taiwan in April and May 2024 respectively.",
    "author": [
      {
        "name": "Nicholas",
        "url": {}
      }
    ],
    "date": "2024-06-04",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nJapan April 2024 trip report\r\nJapan Trip Overview\r\nJapan Butterflies\r\n\r\nTaiwan May 2024 Butterfly trip report\r\nTaiwan Trip overview\r\nTaoyuan (6th-8th May)\r\nTaipei (9th-10th May)\r\nOverall\r\n\r\n\r\n\r\n\r\n\r\nJapan April 2024 trip report\r\nJapan Trip Overview\r\nThis was a family trip between 3rd-13th April around Tokyo - Shizuoka - Yamanashi prefectures primarily for the Sakuras. While I was hoping to get some pictures of butterflies on the sakuras, I guess it was a bit too early in the season for butterflies. The cooler spell in March probably didn’t help as well. Even the sakuras were delayed by a week compared to the 2023 dates.\r\nJapan Butterflies\r\nIn total, I managed to photograph four species, of which three were lifers for me. These were the Indian Red Admiral (Vanessa indica), cf. Asian Green-veined White (Pieris cf. melete) and Celastrina sugitanii. The last one was just a pale grass blue.\r\nIndian Red AdmiralThe weather during the trip was not great and most of the butterflies only appeared on the few sunny days we had. The iNat list can be found here! I ended up getting a copy of “Papilionidae of the World” which is mostly in Japanese with genera descriptions in English. Really nice looking book.\r\nThe book!At least I saw a Tanuki in Enoshima.Taiwan May 2024 Butterfly trip report\r\nTaiwan Trip overview\r\nTaiwan is located at the northern end of the Indomalayan region and is home to 400 species in butterflies, with more than 50 endemics. I was mainly interested in the many interesting species of Blues there. Many of these are localised and are on the wing for only a few weeks a year, making it challenging to see these species. I decided to do a short butterflying trip from 6th - 10th May because the flights were quite cheap and its convenient to get around. Since it was only a five day trip, I decided not to go too far from the airport, with three days in the Taoyuan area and two in Taipei. Another nice thing is that field guides for five of the families (except Nymphalidae) can be found on the government’s website.\r\nTaoyuan (6th-8th May)\r\nDay 1 Arrival and Hutoushan Park (~200m ASL)\r\nWeather: Rather cloudy\r\n\r\n\r\n\r\nI caught the red-eye flight out of Changi and arrived in Taoyuan International Airport at 5.30am. After clearing immigration, I went to get a SIM card (5+1 day for 300NTD) as the Singtel app was down for maintenance the previous night and I didn’t buy data roaming ahead of time. After a quick breakfast at the airport 7-11, I tried to catch the bus to town but the EasyCard I had had negative value. I ended up missing the 6am bus and had to catch the 7am bus. After the 45 minute ride, I dropped off my bags at the hotel (City Suites Taoyuan Station) and went for a second breakfast of beef noodles before going to Hutoushan Park.\r\nClockwise from top: Walking around Hutoushan. MOS burger dinner. Taoyuan room.Hutoushan Park is conveniently located 20mins from Taoyuan Station. The terrain was not too difficult (think BBNP/ TBHP) which was suitable for the first day and but is not too manicured. The morning was rather cloudy and the weather forecast was not very favourable.\r\nThe first attraction was a flock of Taiwan blue magpies not far from the entrance. The spot was a little sunny, attracting some sunbathing butterflies, mainly Limenitidinae. I followed the trails randomly, but spent a bit more time on the hilltops. Along one of the shady trails I got Tagaides tethys. Around noon, I headed towards Guilunshan/ Xinlukenshan, stopping along the way at a cafe for tea with almond jelly. The cafe’s tea plantation had some butterflies including the Indigo Flash, Common Beak (Libythea lepita) and a Pink-spotted Windmill (Byasa impediens). Unfortunately, I was holding my drink for the last one and did not manage to get good shots before it flew off. By then, it was almost 2pm, and I decided to get off the hill to get lunch (luroufan) and top up water. On the way down, I was greeted by a small target, the Beautiful Leopard (Timelaea albescens) hopping on some shrubs.\r\nAfter resupplying, I went back up towards the peak of Guilunshan/ Xinlukenshan. The trail up was guarded by many dogs, making it quite a tense walk up. A few Blue Admirals (Kaniska canace) were sunbathing and dogfighting along the trail. I ended up getting a few species here which I did not see in other areas such as the Indian fritillary and Club Silverline. Around 3.45pm, I made my way down the hill to check in and get some rest.\r\nCommon beak. Tagiades tethys (previously Daimio). Blue Admiral. Beautiful LeopardI decided to splurge a little on accommodations on this trip. I stayed at City Suites Taoyuan Station (~$55/Night). It is right beside the train station with many food options nearby. The room was huge room although it was a little noisy at night. The entrance was hidden between some food stalls.\r\nDay 2 Dongyanshan Lalashan\r\nWeather: Mostly cloudy\r\n\r\n\r\n\r\nFor the next two days, I decided to check out the mountains for the highland species. The first mountain to check out was Dongyanshan which is accessible via bus 5301 from Taoyuan. I was supposed to change buses at Daxi but the guy beside me was sleeping so I decided to continue straight to Lalashan (200NTD/way). The whole journey took 2.5hrs and it drops you off near the Lalashan ticketing office (1300m ASL).\r\nLalashan entrance. Orange noodles karaage. Lunch at Lalashan. Lalashan map.The bus arrived at Lalashan at 9am. After some stretching and buying the entrance ticket (150NTD), I made my way towards the park interior. From the ticketing office, it is another 2.7km uphill walk to the visitors center. Some endemic highland birds such as the White-eared Sibia and the Taiwan vivid niltava were sighted along the way. Butterflies were not as abundant but one of the first butterflies of the day turned out to be the endemic Lethe mahaja. I thought they were common but the others turned out to be L. verma instead. Further up, an Orange Brimstone(Gonepteryx amintha) was seen nectaring on some Bidens. This was another lifer for me (Saw the cleopatra in Spain).\r\n\r\nI made a brief stop at the visitors centre before continuing on the trail. I did the Green -> Yellow -> Pink -> Orange -> Black trails before returning to the visitors centre. The trail went up to about 1700m ASL. It was very quiet, with some birds but nary a butterfly. Around 1pm, I had to head back to the visitors center for lunch to catch the return bus (Last bus departs at 3.30pm I think). On the way, two Scarce Lilacforks (Lethe dura) were puddling near the floor but instantly shot into the canopy upon sensing me. Lunch was once again some braised thing (260NTD). The walk down was slightly better, with a Six-bar Swordtail (Graphium eurous) and an ovipositing Yellow Coster (Acraea issoria) near a patch of Bidens. The Swordtail was not very cooperative and I only ended up with record shots. The bus ride back was an uneventful three hours. I did not manage to see my main target, Horaga rarasana but it is supposed to be an early summer species. しょうがない.\r\nLethe verma. Orange Brimstone. Yellow Costers. Scarce LilacforkDay 3 Dongyanshan - Manyueyuan\r\nWeather: Partly cloudy but the skies got dark around noon for about two hours.\r\n\r\n\r\n\r\nAfter a not very successful previous day, I decided I had enough of mountains and headed to Dongyanshan. The trip there took two hours in total, with a change of bus at Daxi. I ended up catching the second bus with three minutes to spare.\r\nDongyanshan entrance. Dongman trail. Waiting for the bus home. Lunch.I arrived at the Dongyanshan entrance (~900m ASL) at 9am. Since I wanted to exit through Manyueyuan, I did the Geology Trail that leads to the Dongman trailhead. Not much time was spent in Dongyanshan itself. The Geology Trail is a rather flat gravel path through the park. One side is flanked by Bidens which attracted some butterflies. Junonia iphita, Pieris sp and Ypthima spp were commonly seen nectaring on the flowers. Highlights for this section were the Formosan Punch (Dodona formosana) and a puddling Powdered Oakblue (Arhopala bazalus).\r\nA pristine Spotted sawtooth spotted nectaring along the Geology trail.I decided to do the 7.6km Dongman trail which connects Dongyanshan and Manyueyuan National Forest Recreation Area. From the trailhead at 950m ASL, the trail goes up to 1100m before descending to 600m. There were a lot of stairs, especially towards the Manyueyuan side but otherwise it was not a difficult trail. The main butterflies along the trail were the Orange Oakleaf, Ypthimas spp. and Mycalesis spp.. Around noon, the sky turned dark and there was almost no activity. Fortunately, it became more sunny around 1pm and some butterflies were spotted along the way. I managed a record shot of the Sergeant Major (Abrota ganga) sunbathing in a sunlit patch. A few Arhopalas and an endemic cf. Celaenorrhinus horishanus were seen along the way down to Manyueyan.\r\nPowdered Oakblue. Formosan Punch. Celaenorrhinus cf.horishanus. Sergeant Major.By the time I finished the trail, it was already 2pm. Since the foodstand within the park only had snacks and light food, I headed out of the park for mushroom noodles and beancurd. It was too rushed to catch the 3.45pm bus and I had to wait for the 6.10pm bus. The surroundings had a small trail along a creek. There were not any rarities but at least I got the pretty Shiny Spotted Bob (Isoteinon lamprospilus). By 5pm, the light was starting to fade and activity had died down. I ended up waiting at the busstop for an hour. I arrived back in Taoyuan at 7.45pm. After a quick dinner (beef noodles + cabbage) a the stall under the hotel, I caught the train to Taipei.\r\nYpthima tappanaFor Taipei, I decided to continue splurging a little on accommodations. I stayed at Hon Chou Hotel at Ximending (~$55/Night). The room was tiny, with only about 1.5m from the edge of the bed to the toilet but was otherwise fine.\r\nTaipei (9th-10th May)\r\nYangmingshan, Pingding ancient canal (~400m ASL)\r\nWeather: Mostly clear, very windy\r\n\r\n\r\n\r\nAfter the previous day, I felt I needed a little more rest and woke up a little later. After breakfast (some fish crepe thing), I caught the bus to Jiantan station. The bus was supposed to be >10 mins early to change to the Pingding bus but I ended up missing the latter bus. Since the next bus was in an hour, I decided to take a taxi there (-450NTD) and reached Pingding ancient canal at 10.20am. I started the trail by Walking along the top canal. There were some butterflies including a Chitoria chrysolora that perched high a few times. Yellow jesters (Symbrenthia brabira) were also rather common along the trail. Along the main trail, a bridge over the stream was decently productive, with a Five Dot Sergeant (Limenitis sulpitia) and an Angled Sunbeam. A few more common butterflies could be seen puddling along the banks. After crossing the bridge, realised I was taking taking the path away from the planned lunch spot and turned back the other path. However, the cafe was closed that day and the coffeeshop only had coffee. On the way back to the trail, I spotted a Red Ring Skirt (Hestina assimilis) puddling on a banana leaf and an endemic, tattered Penthema formosanum sunbathing. The Red Ring Skirt is not rare but it is quite a pretty butt! The Penthema was not cooperative and I could only get bottom-up shots of it sunbathing. I decided to take another path out to a different part of the park which was uneventful. But right at the end of the trail, an Orange Awlet (Burara jaina) and a White Commodore (Parasarpa dudu) were spotted along the road.\r\nYellow Jester. Penthema formosanum. Chitoria chrysolora. Red Ring Skirt.Burara jaina.Due to some event at a temple, the bus was not stopping at the terminus and I had to walk down to the next stop. As I had 19 mins before the bus arrived, I went to check out the nearby Shengren waterfall. A pair of Blue Admirals were dogfighting and sunbathing at the entrance but did not stay for pictures. A bonus was a friendly Red ring skirt resting and getting blown around in the wind. I caught the bus back to Taipei and had my dunch (dumplings) at 4.30pm. At Z’s insistence, I checked out the Ximending night market near the hotel. It’s alright, no butterflies were spotted there.\r\nPingding ancient canal. And my small roomJiannan and Fuzhoushan\r\nWeather: 晴れ\r\n\r\n\r\n\r\nLast day in Taiwan and I overslept a little again. After a breakfast of leftover guava (probably the best night market food), I set out to the Jiannan Butterfly Garden. At last it was a sunny day in Taiwan. The trip took 30 minutes and I arrived at 8.45am. This place was recommended by Z and I had high hopes for it. The base of the hill was a bit foresty, but the top was planted with host plants, similar to a small butterfly hill. The start had typical butterflies like the Mapwings and Neptis sp.. I finally got the Common Palmfly here, the first in this trip! One of the bushes at the top attracted a lot of Dwarf Crows and a tiger but the area was otherwise quiet. I walked around the hill but after 2 hours with nothing other than a flying orange tip, I decided to change locations. The walk down was more eventful with a Quaker and a Dark Caerulean.\r\nJiannan butterfly garden. Fuyang Ecopark. Fuji san? Friends?For the second half of the day, I went to Fuyang Ecopark. The owner of a store I patronised the previous day mentioned the hill and it seemed somewhat promising on iNat. The two locations are only a 30 minute MRT ride apart on the brown line. Lunch was chicken chop rice from a store next to the MRT.\r\nNot even 100m from the start of the trail was one of my targets, the endemic Satyrium formosana resting on an aroid! It was very pristine and confiding. This turned out to be the only time this trip I used my macro lens. The Regrown Woods area was decent as well, with Arhopalas and a Beautiful Leopard among others. When I headed back to the entrance to use the toilet, I spotted another S. formosana. I initially thought it to be the same individual but the first one was still on the same leaf. It seems to be not uncommon in the correct season. After exploring Fuyang Ecopark, I decided to do the short (300m) hike to the adjacent Fuzhoushan. Fuzhoushan was quiet but I finally managed to get a shot of the Great Orange Tip in this trip.\r\nTwo pristine Satyrium formosanas. South China Bushbrown. Japanese OakblueAs it was getting quiet and there wasn’t time for another location, I headed back to Ximending to grab my bags and made my way to the airport. Dinner was Japanese curry at some mall next to the train station. I took the 9pm train to the airport for my 1am flight back to Singapore. The airport has free showers so that was nice.\r\nOverall\r\nTaiwan was really easy to get around with convenient public transport even to the mountainous areas. The original plan was to rent a bike (even got my IDP) but I wasn’t feeling too good on the first few days so I decided to take the bus. That made it difficult to visit same potential sites along the way.\r\nButterfly abundance and diversity was more disappointing this trip with only about 70 species over the five days and many of the species were only seen once to twice. The diversity of Papilionids and Lycaenids seen were lower than expected.\r\nOther stuff & Cost breakdown\r\nList of stuff I brought for the trip\r\nGear:\r\n- Canon R7\r\n- Sigma 150mm f2.8 macro (Only used this for the Satyrium)\r\n- Canon 100-400 f/4.5-5.6L II\r\n- Canon Speedlite 600EX & 430EXII\r\n- Garmin GPSMAP 65s\r\nBreakdown of expenditure for this trip:\r\n\r\n\r\nDate\r\n\r\n\r\nFlight (SGD)\r\n\r\n\r\nAccommodations (SGD)\r\n\r\n\r\nTransport\r\n\r\n\r\nBreakfast\r\n\r\n\r\nLunch\r\n\r\n\r\nDinner\r\n\r\n\r\nEntrance Fee\r\n\r\n\r\nOther\r\n\r\n\r\n6-May-24\r\n\r\n\r\n330\r\n\r\n\r\n55\r\n\r\n\r\n80\r\n\r\n\r\n120\r\n\r\n\r\n242\r\n\r\n\r\n275\r\n\r\n\r\n\r\n\r\n300\r\n\r\n\r\n7-May-24\r\n\r\n\r\n\r\n\r\n55\r\n\r\n\r\n400\r\n\r\n\r\n95\r\n\r\n\r\n260\r\n\r\n\r\n195\r\n\r\n\r\n150\r\n\r\n\r\n\r\n\r\n8-May-24\r\n\r\n\r\n\r\n\r\n55\r\n\r\n\r\n268\r\n\r\n\r\n\r\n\r\n184\r\n\r\n\r\n110\r\n\r\n\r\n80\r\n\r\n\r\n\r\n\r\n9-May-24\r\n\r\n\r\n\r\n\r\n55\r\n\r\n\r\n545\r\n\r\n\r\n150\r\n\r\n\r\n210\r\n\r\n\r\n125\r\n\r\n\r\n\r\n\r\n\r\n\r\n10-May-24\r\n\r\n\r\n\r\n\r\n\r\n\r\n240\r\n\r\n\r\n\r\n\r\n350\r\n\r\n\r\n328\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nSum\r\n\r\n\r\n\r\n\r\n\r\n\r\n1533\r\n\r\n\r\n365\r\n\r\n\r\n1246\r\n\r\n\r\n1033\r\n\r\n\r\n230\r\n\r\n\r\n300\r\n\r\n\r\nNote: \r\n\r\n\r\n Other than Flight and Accomodations, values in NTD\r\n\r\n\r\nOverall, the trip was quite affordable, with about $200 spent on necessities in Taiwan over the five days. The flights were surprisingly cheap as well. I guess I will have to return for more of the endemics sometime.\r\n\r\n\r\n\r\n",
    "preview": "posts/2024-05-23-japan-taiwan-2024/img/saty.jpg",
    "last_modified": "2024-06-04T16:58:20+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2024-02-12-sri-lanka-nov-2023/",
    "title": "Sri Lanka Nov 2023",
    "description": "A brief post on my casual trip to Sri Lanka.",
    "author": [
      {
        "name": "Nicholas",
        "url": {}
      }
    ],
    "date": "2024-02-12",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nSri Lanka Nov 2023 Casual Butterfly Trip ReportOverview\r\nLogistics\r\nSinharaja (Pitadeniya entrance)\r\nYala National Park Block 1\r\nNuwara Eliya\r\nOverall\r\n\r\n\r\nSri Lanka Nov 2023 Casual Butterfly Trip Report\r\nOverview\r\nSri Lanka has quite a diverse range of habitats from tropical lowland forests to cloud forests and savannahs. However, the butterfly diversity is surprisingly low at only around 240 species.\r\nI went to Sri Lanka from 22 Nov to 2 Dec for a trip. As I was with family and not a dedicated butterfly trip, I could not devote as much time as I would like to butterflying. This post will just focus on the main areas where I could butterfly (in bold).\r\nOutline of route:\r\n1. Negombo\r\n2. Mirissa\r\n3. Sinharaja (Pitadeniya)\r\n4. Yala\r\n5. Nuwara Eliya\r\n6. Sigiriya\r\nLogistics\r\nI got the contact of a driver (Geeth) through HZ. He charges around 75USD a day and he helped to organise all the hotels, tours and food. Excellent driver, highly recommended! Hotels were approximately 50USD/night for three people. Exchange rate at that time: 1USD = 325 Sri Lankan Rupees.\r\nSinharaja (Pitadeniya entrance)\r\nThis was the most expensive hotel at 80/night but at least my mum can claim to have gone glamping before. I think she prefers a normal hotel now. The guide (a half day walk in the forest + a morning birding session) was organised through the hotel which was rather expensive.\r\nIn terms of butterflying, the forest was very quiet with some Clippers, a Commander and a Metallic Caerulean. The vertebrates were more interesting and we saw the endemic Kangaroo Lizard, Hump-nosed Lizard, whip snake and viper. For birds, we got the Spot-winged Thrush as the highlight. Based on some other reviews, the northern entrance might be better for wildlife. Overall, very quiet but it was worth it to see my mother get leeched.\r\nAfter the guided walk, I had some time to explore the area near the entrance and village which was decent. The endemic Eurema cf. ormistoni and Celaenorrhinus spilothyrus were both shot there. Other butterflies include the Angled Pierrot (Caleta decida) and the White Four Ring (Ypthima ceylonica).\r\nCelaenorrhinus spilothyrus, the Sri Lankan Black Flat was spotted along the path to the park entrance.The next morning, we went for a guided walk around the village for birds and managed to get a few endemics. But the main site of interest was the accommodations which had a flowering Elaeocarpus sp. It attracted many Common Jezebels (Delias eucharis) and two endemic Ceylon Tree Nymphs (Idea iasonia). The rest of the gardens attracted some tigers (Ideopsis and Parantica) as well as the Blue Mormon (now a subsp. of Papilio agenor).\r\nA Ceylon Tree nymph resting! One of my targets.Yala National Park Block 1\r\nWe did a full-day safari at Yala Block 1 to maximise our chances of seeing a Leopard. It costed us ~150USD for the tour and another 30USD for the entrance fee. For the full day safari, it runs from about 5am - 6pm. 12-2pm is a no move time where the drivers are not allowed to move. Unfortunately, our Hilux got stuck at 11am and another vehicle could only help to pull us out at ~3pm. This gave me around some time to walk near the vehicle to look for butterflies which happened to be the most butterfly productive part of the day. The Pieridids were puddling around the trail, consisting of Appias sp (unsure if they were albina or the endemic galene), Ixias and Euremas etc. Highlights were the Monkey Puzzle (Rathinda amor), Small Salmon Arab (Colotis amata), White Orange Tip (Ixias marianne) and a Dark Wanderer (Pareronia ceylanica). None of these are supposed to be rare but they were all lifers for me. The Crimson (Pachliopta hector) was also common along the trails. Once we were rescued, the focus was again on birds.\r\nThe Monkey Puzzle! A very interesting lookign Theclinae.Crimson Rose. A common butterfly seen many times flying along the trails in Yala NP and even 1km out over the ocean.Oh and a leopard right before closing time. It was a mad rush getting to the location and out of the park by 6pm.\r\nLeopard.Nuwara Eliya\r\nThe main site was Horton Plains National Park (~2100m ASL). The 30USD entrance fee was worth it for the views and landscape alone. We did the standard loop around World’s End trail which took a few hours. The butterfly diversity was expectedly low but I managed to get the endemic Ceylon Tiger (Parantica taprobana) and a suspected Lethe cf. daretis. The Lethe was a bit too worn though. The other butterflies were not very confiding.\r\nThe endemic Ceylon Tiger. Seems to be restricted to the highlands.The worn Lethe that I think is a daretis.Overall\r\nThe butterfly diversity on this trip was not very high at all with around 55 species over 10 days. At least I managed to get a few of my targets and endemics such as the Ceylon Tree Nymph and Monkey Puzzle. But overall, it was a pretty enjoyable trip. It was not a very cheap place though.\r\nThe list of sightings can be found on my INaturalist.\r\n\r\n\r\n\r\n",
    "preview": "posts/2024-02-12-sri-lanka-nov-2023/img/idea.JPG",
    "last_modified": "2024-02-12T15:28:37+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-11-11-sabah-oct-2023/",
    "title": "Sabah Oct 2023",
    "description": "A short trip to Kota Kinabalu and Mahua Waterfall.",
    "author": [
      {
        "name": "Nicholas",
        "url": {}
      }
    ],
    "date": "2023-11-11",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nSabah Oct 2023 Butterfly Trip ReportSabah Overview\r\nKota Kinabalu Outskirts (9-11 Oct)\r\nPart 2 Tambunan (12-15 Oct)\r\nNumbers and checklist\r\nThoughts:\r\nOther stuff & Cost breakdown\r\n\r\n\r\nSabah Oct 2023 Butterfly Trip Report\r\nSabah Overview\r\nBorneo is home to more than 900 species of butterflies with around 81 endemic species. It is a relatively popular butterflying area due to the species richness, endemism and relative proximity to Singapore. This was my first butterflying trip in Borneo although I have been to Mulu (Sarawak) and Tawau (Sabah) for leisure.\r\nFor this trip, I tagged along with Ash, Choy and Lee to some of the more popular butterflying sites around Crocker Range. We covered a relatively small portion of the state, with the focus being the Tambunan area (Malungung Control Post and Mahua Waterfall). Most of the sites were lowland to submontane tropical forests.\r\nNon-exhaustive wishlist: Endemics of course especially Stibochiona schoenbergi. Malayan Owl, Silky Owl, Ninja, Awlkings, Glorious Begum, Tufted Jungle King, Malayan Jungle Glory.\r\nKota Kinabalu Outskirts (9-11 Oct)\r\nFor the first part of the trip, we were based out of Kota Kinabalu and took day trips out to the sites. We stayed at KK 818 OYO which was rather dated and didn’t have many electrical outlets but was good enough (~30SGD/night). It was quite well located with malls, eateries, and a supermarket nearby.\r\nClockwise from topleft. 1) Hotel room. 2) Sheng Rou Mian. 3) Ayam panggang. 4) Packed lunch. Note the chopsticks on the ground.\r\n\r\n\r\n\r\n\r\n\r\nDay 1: Tun Fuad Stephen Park/ Shalom Valley Park\r\nWeather: Sunny, cloudy\r\nCW from Topleft. 1) Shalom Valley Park. 2) Kiulu Rainforest Park river. 3) Kiulu Rainforest Park from the observation deck. 4) Bridge at Kokol Haven Resort.The flight was slightly delayed and we landed at KK at ~1130hrs. After meeting the driver and quick Sheng Rou Mian lunch, we headed off to Tun Faud Stephen Park. At the carpark, we found a Veined Grass Dart (Taractrocera luzonensis) and an Ancrya Blue. However, the trails are closed until 2024. We decided to change locations to Shalom Valley Park which was a half hour drive away. Shalom Valley Park is a small recreational area beside a forest with a small river running through the place. It even has a rabbit area. We were charged a ~10rm entrance fee. One of the first butterflies we spotted was the Green Imperial (Manto hypoleuca) feeding on some mistletoe on an Andira inermis (unsure). While wandering around the area, a friendly Common Sergeant (Athyma perius) allowed for some shots. There were many Troides flying around but the one I managed to shoot turned out to be a Malayan Birdwing (Troides amphrysus). The last highlights were the probable Tawny Bushhbrowns (**Mydosama cf. anapita*) which seem attracted to some fallen rambutans.\r\nGreen Imperial.Day 2: Kiulu Rainforest Park & Mari Mari Cultural Forest (~200m ASL)\r\nWeather: Clear, showers in afternoon then cloudy\r\nWe set off at 8am from KK to Kiulu Rainforest Park (25rm entrance fee) which was an hour’s drive away. It is quite a large recreational area in the forest with chalets and other amenities which looked quite well maintained. We baited along the river while exploring the other parts of the park. Along the trail further in, a skittish Tufted Jungle King (Thauria aliris) was attracted to some fallen fruit but unfortunately, it did not stay for shots. There were lots of lantern bugs nearby as well. Further in, there was a clearing with some skippers and Jamides (J. aratus & J. talinga). Back at the bait site, a Bornean Straight Pierrot (Caleta manovus) was puddling. I decided to hike up to the canopy walk. There were some interesting butterflies along the way, but only a Yellow Baron (Euthalia kanda) perched for shots. While I was doing the canopy walk, the others had spotted a Silky Owl (Taenaris horsfieldii) near some shelters. I did not see it but got my first Common Tree Nymph (Idea stolli) and a Yellow Archduke (Lexias canescens). The latter was quite different from what we usually see in Singapore, with much wider markings. We decided to change locations after lunch and went back outside. The carpark had a few Bornean Straight Pierrot, Rajah Brooke’s Birdwing and some other puddlers.\r\nBornean Straight Pierrot, an endemic.Around 1300hrs, we arrived at the Kiulu rafting area but the only butterfly in the hour we waited was a Great Mormon. We moved on to Mari Mari Cultural Village. There were some showers on the way and the skies became very cloudy. However, Mari Mari Cultural Village has a 100rm entrance fee and we did not want to pay that in such overcast weather. We hung around the outside shooting a Purple Bushbrown and a Striped Ringlet before turning back at 1545hrs.\r\nPurple Bushbrown showing a glimpse of its upperside. It is purple.Day 3: Kokol Haven Resort & Ulu Kionsom Waterfall (~800m ASL)\r\nPartly cloudy in the morning, heavy rains in the afternoon\r\nFor the last day in KK, we left the hotel at 8am for the 40min drive to Kokol Haven Resort (~800m ASL, 10rm entrance fee). Upon arriving, we headed straight to the jungle trekking area, a very small patch of forest with a trail (around 15mins of slow walking). Ash and Lee spotted a biggish yellow butterfly that might have been a Gorgon but none of us managed to get a shot of it. There were quite a few Caeruleans and Banded Yeomans (Cirrochroa orissa) flitting around the trail. The bridge proved quite productive with a Witch (Araotes lapithis) and an endemic Tanaecia orphne. Outside the trail, Ash found a fruiting longan tree that was attracting several butterflies and called us over. We got one of the highlights of the day there, a Distant’s/Spotted Silverstreak (Iraota distanti). It was quite shy but returned several times giving us some opportunities for photos. Shortly after, we spotted a White Four-lined Blue (Nacaduba angusta) perched on a high branch. I decided to head back to the trail and spotted an Arhopala paraganesa along the way.\r\nArhopala paraganesa.It was skittish to flash but stayed around long enough for everyone to get some shots. Along the trail, a confiding, small caerulean was perched on some grass. It turned out to be the endemic Jamides lugine which has a distinctive purple upperside! Due to the approaching dark clouds, we headed to the restaurant for a relaxing two-hour lunch. Once the rain ended, we decided to check out the nearby Ulu Kionsom waterfall (10rm entrance fee). With the overcast weather and the crowd of picnickers, it was not very productive. I managed to shoot one of my targets, the Malayan Jungle Glory (Thaumantis odana) after the flight of stairs. We headed back early as there wasn’t much butterfly activity in those conditions.\r\nJamides lugine!Part 2 Tambunan (12-15 Oct)\r\nThe room was basic but clean and seems to have been much improved from the last time Ash stayed here. The tap water was mostly alright and there was a heater water for showers. It gets quite cold at night; I slept in my raincoat, socks and two blankets with the fan turned off. The lodge’s porch lights also attracted a number of interesting bugs (moths, Megaloptera, Neuroptera, Trichoptera). Food was flexible, tasty, cheap and fruity. Each meal was around 60-70rm for four people. The only downside is that there isn’t phone reception there.\r\nCW from topleft. 1) The restaurant at Mahua. 2) Room at Mahua. 3&4) Meals at Mahua\r\n\r\n\r\nDay 4: Malungung Control Post (~850m ASL)\r\nMostly cloudy-overcast\r\nCW from topleft. 1) Entrance to Malungung Control Post. 2) Ranger Station at Malungung Control Post. 3&4) Trail and waterfall around Mahua Waterfall.We set off from KK at 0730hrs to Malungung Control Post. It is a 2.5hr journey by car depending on the traffic and we arrived around 10am. We shot a Green Awl (Hasora salanga) and some other butterflies around the station before entering the trail. Along the river opposite the ranger station, there were some puddlers already there including a male Silver Royal (Ancema blanka). We placed some bait and a Banded Angle (Odontoptilum pygela) immediately joined in. There were the typical hedge blues and Prosotas in small numbers. Near the start of the trail, we spotted a confiding Eyed Cyclops (Erites argentina) and a Broad Striped Faun (Faunis kirata), both lifers for me. We then went further in and crossed the river two more times (three times total) but did not spot much butterflies along the way and turned back. On the way out, Lee spotted a Banded Bushbrown (Mycalesis maianeas) and a Bornean Oakleaf (Kallima buxtoni). We decided to head to Mahua as activity was getting a little quiet. Just after the shelter, Chan spotted a Silky Owl (Taenaris horsfieldii) perched high but open. After securing some record shots, we scrambled up the sides of the slope to get eye-level shots!\r\nThe Silky Owl. One of my favourite butterfly from this trip.After the excitement of the Silky Owl, it turned out that the driver had gone out for lunch. While waiting for him to return, I explored a path near the entrance which we had skipped earlier. Around 50m from the entrance, an Allotinus landed near me. I got a couple of record shots and suspecting that it was A. brooksi, went to call the others. We went back in search of it but it had flown off and settled with a Rounded Mottle (Logania regina) as a consolation prize. The driver returned soon after and we headed to Mahua which was an hour’s drive away. After resupplying in town, we arrived at Mahua at 4pm.\r\nAllotinus brooksi. Thanks JK for the information.Day 5: Mahua (~1100m ASL)\r\nMostly cloudy, brief showers.\r\nSince we stayed right outside the waterfall, I started around 0730hrs for the following days. The early morning butterflies were mainly Hasora spp. and sunbathing Mycalesis pitana. We spotted another Silky Owl before going for breakfast. While eating, Lee found a cute Udara dilectissima on the mulberry tree near the restaurant. After a quick breakfast, we checked the carpark for puddlers before heading towards the waterfall (20rm/3day). Forest Quakers (Pithecops corvus) were common on the wildflowers outside. The trails around the waterfall were quiet, but I obtained better shots of the Bornean Oakleaf and the Yellow-barred Pan (Xanthotaenia busiris).\r\nBack outside, several puddlers had arrived including a Bornean Sawtooth (Prioneris cornelia), and a very tattered Kinabalu Swordtail (Pathysa stratiotes).\r\nKinabalu Swordtail.The platform was quite fruitful with a Banded Peacock (Papilio Palinurus), Yellow Jezebel (Appias cardena) and Blue Banded Pierrot (Discolampa ethion). The Banded Peacock returned several times before resting on a nearby bush, giving opportunities for upperwing shots. Right before lunch, a rather pristine Kinabalu Swordtail landed at the carpark and gave everyone opportunities to get some shots. We went for lunch when it started showering. After the rain ended, I went back into the forest and only got a bad angle of a Ninja (Amnosia decora). The last highlight of the day was an Allotinus near the ticketing office which we later identified as A. otsukai, another endemic.\r\nA cute Blue Banded Pierrot.Allotinus otsukai.6: Mahua\r\nMorning sunny, afternoon rainy and foggy.\r\nThis morning, I went for improvement shots of M. pitana. Chan spotted a torn Simiskina pharyge, the first for the trip. A Kinabalu Swordtail and Banded Angle were puddling at platform, and I mainly tried for openwing shots of the Swordtail. Along the trail to the waterfall, we spotted a male Ninja sunning but otherwise the trail was quiet. At the platform, two friendly Borneo Birdwings were puddling (Troides andromache). We soon went for lunch when it started drizzling. The Kinabalu Swordtail was still at the platform even in the rain. As the weather was worsening, the others went back to rest while I explored the road back towards the kampung. I also gave up at 1600hrs and went back to do some IDing.\r\nA puddling Borneo Birdwing.Day 7: Mahua - Flight home\r\nMostly sunny-cloudy\r\nAs expected, the weather on the last day was better than the past few days. As there was an accident at the waterfall yesterday, the rangers had to close off the waterfall. However, the guy told us that we could still go around the outer area so we mainly walked between the carpark and the front part of forest (as shown on the map above). Near the ticketing office, a rather worn Malayan Owl (Neorina lowii) was sunning which was a lifer for me and my second bird of the trip.\r\nMalayan Owl. Second owl of this trip and I didn’t even have to go out at night.Ash alerted me to a puddling Bornean Mormo (Papilio acheron) at the platform which I had been trying to get since I missed it on the first day at Mahua. A tattered great Mormon soon joined it. Inside the forest trail again I shot a Celaenorrhinus and a Kinabalu Ringlet (Ragadia annulata) that briefly landed a few meters away from me. I went out to inform the others and they hurriedly waved me over for an oakblue near the carpark shelter. It was a friendly Arhopala kinabala! It was quite windy but it stayed perched on a leaf two meters up. I went to get a chair over to get a better angle. While the others continued to shoot it, I went back into the forest. Not 100m from the entrance, I saw a sunbathing skipper with a yellow tornal area and thought it was an Awlking. Upon noticing me, it closed up and I got some shots of the underside. I then realised it was the endemic Pirdana albicornis. I ran out to get the others but as usual it was too late and we couldn’t find it.\r\nThe endemic Pirdana albicornis.During lunch, Lee spotted another oakblue at mulberry tree which he thought is another A. kinabala but it flew off before we could get shots. After lunch, we wandered around but there weren’t any new additions. The A. kinabala was still around and had shifted to a lower perch. It stayed for more than 2 hours! As we had arranged to meet the driver at 1500hrs, we went back to take a shower and pack up for the trip back to airport.\r\nArhopala kinabala. A very fancy Arhopala.Numbers and checklist\r\nThe list of sightings can be found on my INaturalist.\r\n\r\n\r\n\r\nFamily\r\n\r\n\r\nScientific Name\r\n\r\n\r\n9 Oct\r\n\r\n\r\n10 Oct\r\n\r\n\r\n11 Oct\r\n\r\n\r\n12 Oct\r\n\r\n\r\n13 Oct\r\n\r\n\r\n14 Oct\r\n\r\n\r\n15 Oct\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium antiphates\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium doson\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium sarpedon\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium stratiotes\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n2\r\n\r\n\r\n2\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nLamproptera meges\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio acheron\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio demoleus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio demolion\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio helenus\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio memnon\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio nephelus\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio palinurus\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nTrogonoptera brookiana\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n2\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nTroides amphrysus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nTroides andromache\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nAppias cardena\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nAppias lyncida\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nCepora iudith\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nGandaca harina\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nLeptosia nina\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nPrioneris cornelia\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nAmnosia decora\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nAthyma perius\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCharaxes bernardus\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nChersonesia intermedia\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCirrochroa orissa\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCupha erymanthis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCyrestis maenalis\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n2\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCyrestis nivea\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nDichorragia nesimachus\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nErites argentina\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nEuthalia kanda\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nFaunis kirata\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nHypolimnas bolina\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nIdea stolli\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nIdeopsis vulgaris\r\n\r\n\r\n\r\n\r\n\r\n\r\n2\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nJunonia hedonia\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nJunonia iphita\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nJunonia orithya\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nKallima buxtoni\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLebadea martha\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLexias canescens\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLexias dirtea\r\n\r\n\r\n\r\n\r\n\r\n\r\n2\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n2\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLibythea myrrha\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nMycalesis maianeas\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nMycalesis orseis\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nMycalesis pitana\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nNeorina lowii\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nParantica aspasia\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nParthenos sylvia\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nPolyura athamas\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nRagadia annulata\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nRagadia makuta\r\n\r\n\r\n\r\n\r\n3\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nSymbrenthia hypselis\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nTaenaris horsfieldii\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nTanaecia iapis\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nTanaecia orphne\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nTelinga janardana\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nThaumantis noureddin\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nThaumantis odana\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nThauria aliris\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nVindula dejone\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nVindula erota\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nXanthotaenia busiris\r\n\r\n\r\n\r\n\r\n2\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nYpthima fasciata\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n2\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nYpthima pandocus\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nRiodinidae\r\n\r\n\r\nZemeros emesoides\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nRiodinidae\r\n\r\n\r\nZemeros flegyas\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nAllotinus brooksi\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nAllotinus otsukai\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nAncema blanka\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nAnthene lycaenina\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nAraotes lapithis\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nArhopala kinabala\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nArhopala paraganesa\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nCaleta elna\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nCaleta manovus\r\n\r\n\r\n\r\n\r\n2\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nCatopyrops ancyra\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nCelastrina algernoni\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nCelastrina lavendularis\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nDiscolampa ethion\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nDrupadia ravindra\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nDrupadia theda\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nEooxylides tharis\r\n\r\n\r\n\r\n\r\n2\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nIonolyce helicon\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nIraota distanti\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nJamides alecto\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n2\r\n\r\n\r\n2\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nJamides aratus\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nJamides caeruleus\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nJamides lugine\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nJamides talinga\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nLogania regina\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nLuthrodes pandava\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nManto hypoleuca\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nNacaduba angusta\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nPithecops corvus\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nPlautella cossaea\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nProsotas bhutea\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nProsotas nora\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n2\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nRapala dieneces\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nSimiskina pharyge\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nUdara dilectissima\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nUdara selma\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nUna usta\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nZizina otis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nAncistroides nigrita\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nHasora salanga\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nHasora schoenherr\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n2\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nKoruthaialos rubecula\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nMooreana trichoneura\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nNotocrypta paralysos\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nOdontoptilum pygela\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nPirdana albicornis\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nPseudocoladenia dan\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nTaractrocera luzonensis\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nUdaspes folus\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNote: Data extracted from inat on 11 Nov 2023A 1/2 in the table indicates presence at the site\r\nOnly individuals identified to Species level were used included\r\nThoughts:\r\nThanks, Ash, for organizing the trip and logistics! Please find him to organize such trips!\r\nOverall, the abundance of butterflies on this trip was really quite low. The frequent afternoon rains did not help and several afternoons were wasted. Despite baiting, aggregations did not form and most bait sites had <10 of butterflies at a time. The interior of the forests was also quiet as well. However, I got 115 species which is decent. October is probably the offseason for butterflying in Sabah and should be better in the dryer months. I didn’t manage to see couple of butterflies I wanted such as Stibochiona schoenbergi and the Bornean Sapphire (Heliophorus kiana). However, we did get some rare butterflies so it was still a good trip. My highlights were 1) the eye-level shot of the Silky Owl 2) Pirdana albicornis 3) Arhopala kinabala 4) Jamides lugine and the Allotinuses.\r\nNext up should be a casual trip to Sri Lanka in November.\r\nOther stuff & Cost breakdown\r\nList of stuff I brought for the trip\r\nGear:\r\n- Canon R7\r\n- Sigma 150mm f2.8 macro\r\n- Canon 100-400 f/4.5-5.6L II\r\n- Canon Speedlite 600EX\r\n- Garmin GPSMAP 62S (Thanks YZ!)\r\nBreakdown of expenditure for this trip.\r\n\r\n\r\nDate\r\n\r\n\r\nTransport\r\n\r\n\r\nAccommodations\r\n\r\n\r\nMeals\r\n\r\n\r\nEntrance Fee\r\n\r\n\r\nOther\r\n\r\n\r\n9-Nov-23\r\n\r\n\r\n62.5\r\n\r\n\r\n100\r\n\r\n\r\n51\r\n\r\n\r\n10\r\n\r\n\r\n22\r\n\r\n\r\n10-Nov-23\r\n\r\n\r\n75\r\n\r\n\r\n100\r\n\r\n\r\n43\r\n\r\n\r\n8\r\n\r\n\r\n\r\n\r\n11-Nov-23\r\n\r\n\r\n62.5\r\n\r\n\r\n100\r\n\r\n\r\n70\r\n\r\n\r\n20\r\n\r\n\r\n\r\n\r\n12-Nov-23\r\n\r\n\r\n62.5\r\n\r\n\r\n40\r\n\r\n\r\n30\r\n\r\n\r\n\r\n\r\n\r\n\r\n13-Nov-23\r\n\r\n\r\n\r\n\r\n40\r\n\r\n\r\n55\r\n\r\n\r\n20\r\n\r\n\r\n\r\n\r\n14-Nov-23\r\n\r\n\r\n\r\n\r\n40\r\n\r\n\r\n55\r\n\r\n\r\n\r\n\r\n\r\n\r\n15-Nov-23\r\n\r\n\r\n115\r\n\r\n\r\n\r\n\r\n55\r\n\r\n\r\n\r\n\r\n\r\n\r\nNote: \r\n\r\n\r\n Values in RM. Exchange rate of 1SGD = 3.43 RM\r\n\r\n\r\nThe flight costed $134.\r\nIn total, I spent about $600 for this trip.\r\n\r\n\r\n\r\n",
    "preview": "posts/2023-11-11-sabah-oct-2023/img/egg.JPG",
    "last_modified": "2023-11-11T23:20:59+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-10-04-third-anniversary-update/",
    "title": "Third anniversary update",
    "description": "Third anniversary update with graphs!",
    "author": [
      {
        "name": "Nicholas",
        "url": {}
      }
    ],
    "date": "2023-10-04",
    "categories": [],
    "contents": "\r\nYear 3 butterfly summary. Started around 5 Oct 2020. Numbers in the brackets show the change from Year 2.\r\nNumber of lifers: 285 (+20) (includes a most likely Arhopala sublustris and Jewelled grass blue which is not yet on the checklist. Does not include a potential Curetis sperthis IDed by Dr Seow.) The numbers do not really tally with the previous summaries because I have gone back to ID some old photos.\r\nNumber of trips made:\r\nBreakdown of families (Using a modified checklist)\r\nPapilionidae: 14/18 (+1)\r\nPieridae: 15/23\r\nNymphalidae: 83/103 (+5)\r\nRiodinidae: 5/5\r\nLycanidae: 100/120 (+13)\r\nHesperiidae: 62/82 (+4)\r\nLast 5 lifers: Striped black crow, Hoary palmer, Flash Royal, Malayan swift, Jewelled grass blue.\r\nSpecies accumulation by date. Dotted lines to separate years.Sepecies accumulation by trips made. Dotted lines to separate years.Surprises:\r\n1) Black rajah (Charaxes solon) at Rifle Range Link in November 2022. Got drenched for this one.\r\n2) Flash royal (Tarjuria deudorix) at Ridout Road of all places.\r\n3) Black striped crow (Euploea eyndhovii) in my hard disk.\r\nClockwise from topleft: Black rajah, Flash royal, Pitcher blue, Striped black crowSurpassed my Year 3 target of 275 by 10 species. Year 4 target: 290. Definitely plateauing now.\r\nOversea trips in this butterfly year: a week in Central Thailand and a week in north Vietnam. You may find the Vietnam post here.\r\nUpcoming trips: Sabah (next week) and Sri Lanka.\r\nWishlisted butterflies: Banded yeoman, Malay gem, Sky blue, Catapaecilma spp., Tarjuria dominus, Narrow spark, Suffused flash, Storey’s palmer.\r\nThanks Krystal :)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-10-04T16:40:27+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-09-14-second-anniversary-repost/",
    "title": "Second Anniversary Repost",
    "description": "This is a repost of my second butterfly anniversary summary. I originally posted it on Facebook but have decided to keep it here.",
    "author": [
      {
        "name": "Nicholas",
        "url": {}
      }
    ],
    "date": "2023-09-14",
    "categories": [],
    "contents": "\r\nOriginally posted on Facebook on 4 October 2022.\r\nYear 2\r\nYear 2 butterfly summary. Started on 5 Oct 2020 apparently. Numbers in the brackets show the change from Year 1.\r\nNumber of lifers: 256 (+62)\r\nNumber of trips made: 133\r\nBreakdown of families (Using a modified checklist)\r\nPapilionidae: 13/18 (no change)\r\nPieridae: 15/23 (+2)\r\nNymphalidae: 78/103 (+11)\r\nRiodinidae: 5/5 (+2)\r\nLycanidae: 87/115 (+23)\r\nHesperiidae: 58/80 (+24)\r\nNumber of singletons: 35\r\nBiggest day: 61 species, 22 Jan 2022, Pulau Ubin. With Eunice and Sebastian\r\nLast 5 lifers: Paintbrush swift, Indian cupid, Large dart, Yellow flat, Mutal oakblue\r\nSome good additions: Common onyx, White club flitter, Arhopala trogon, Large metallic oakblue, Malayan oakblue, Colon swift & more.\r\nAdditional butts: 15 from Spain. And an uncounted number from Malaysia.\r\nY3 target - 275. Definitely plateauing now.\r\nThanks buttfriends.\r\nDotted lines to separate years.Dotted lines to separate years.\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-09-14T22:12:00+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-09-05-first-anniversary-repost/",
    "title": "First Anniversary Repost",
    "description": "This is a repost of my first butterfly anniversary summary. I originally posted it on Facebook but have decided to keep it here.",
    "author": [
      {
        "name": "Nicholas",
        "url": {}
      }
    ],
    "date": "2023-09-05",
    "categories": [],
    "contents": "\r\nOriginally posted on Facebook on 5 Oct 2021.\r\nBeen butterflying for exactly a year now and recording most of it on scythebill. The records for the first two months were only based on photos but non photographed sightings were included later in most trips. So here’s my progress.\r\nTotal species: 194\r\nBreakdown of families (Using an older checklist)\r\nPapilionidae: 13/18\r\nPieridae: 13/23\r\nNymphalidae: 67/101 +1 ssp for jacintha eggfly\r\nRiodinidae: 3/5\r\nLycanidae: 64/113\r\nHesperiidae: 34/77\r\nSome highlights\r\nVery rares (based on Khew, 2015. Some have probably changed status by now): Malayan jester, silver royal, banded royal, malay staff sergeant, yellow chequered lancer, white tipped baron, angled castor.\r\nMost species in a trip: 51 species from Pulau Ubin on 27 August 2021 with two lifers (angled castor and dark cerulean).\r\nLatest lifer: Banded lineblue\r\nThanks buttfriends\r\nThis graph shows the number of lifers accumalated over the tripsSimilar to the above but in days instead.\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-09-05T22:21:49+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-07-27-north-vietnam-2023/",
    "title": "North Vietnam 2023",
    "description": "Detailing a week-long solo butterfly trip to North Vietnam.",
    "author": [
      {
        "name": "Nicholas",
        "url": {}
      }
    ],
    "date": "2023-07-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nNorth Vietnam 2023 Butterfly trip reportVietnam Overview\r\nCuc Phuong National Park (17th-20th June)\r\nBa Vi National Park (21st-23rd June)\r\nNumbers and checklist\r\nOther stuff & Cost breakdown\r\n\r\n\r\nNorth Vietnam 2023 Butterfly trip report\r\nVietnam Overview\r\nVietnam is home to more than 1200 species of butterflies, a number similar to Thailand and Malaysia. However, it remains a lesser popular destination for Singapore butterfly enthusiasts perhaps due to a lack of easily available information in English. For this trip, I decided to focus on two areas not far from Hanoi, Cuc Phuong National Park (CPNP) and Ba Vi National Park (BVNP). CPNP, Vietnam’s first national park, is typical lowland tropical rainforest. BVNP (altitude ~200-1300m) has a transition towards submontane forests. Even though the two locations are not too far apart, I hoped to find some difference species in the two areas.\r\nWhile planning this trip, I faced some difficulties in finding a comprehensive checklist. Cat Tien National Park in the south had a nice checklist of about 450 species but I could not find a similar checklist for CPNP and BVNP. The closest was a 2003 article which listed the number of butterflies of each genera (total ~400sp) that can be found in CPNP. There are also a few shorter lists by hobbyists and journal articles.\r\nI decided to explore these two parks from 17th to 24th June 2023. The first four days (17th-20th June) were spent in CPNP, the next 2.5 days (21st-23rd June) in BVNP and the last day in Hanoi. My main targets for this trip were the yellow gorgon (Meandrusa payeni), jungle queens (Stichophthalma spp) and Lethe spp. The paths I took for the following days can be found in the maps below.\r\nCuc Phuong National Park (17th-20th June)\r\nDay 1 and arrival\r\nI arranged transport and accommodations at CPNP directly through the park via email. For the rooms, I opted for the third class rooms (500k - 600k VND/night). The process was rather straightforward despite a little language barrier.\r\nAfter a little hiccups, I met the driver at Hanoi’s Noi Bai International Airport at 2.30pm. It was a 3.5 hour drive to CPNP and it was already 6pm by the time I arrived. The trip looked off to a good start with two Penthema darlisas in the park HQ office. Since I had arrivedd a little later than expected, I decided to do a self-guided night walk (a guided nightwalk organised by the park would cost 800k VND). After settling down in my room and a quick dinner at the restaurant, I set off on my walk around the HQ. I managed to find a few Eurema spp, lemons emigrants (Catopsilia pomona) and Penthema darlisa but my search for mammals and herptiles were unsuccessful.\r\n\r\n\r\n\r\n\r\n\r\n\r\nDay 2\r\nWeather: Very warm and humid. Cloudy with occasional showers.\r\nI started the day at 8.15am and decided to explore the trails towards the animal rescue centres. As it was still rather early, butterfly activity was low but I managed to shoot the black-spotted labyrinth (Neope muirheadii), Telinga malsara?, Shan Nawab (Polyura nepenthes) and a few other species.\r\nClockwise from topleft: The third-class room. Cuc Phuong National Park entrance. Towards the park’s interior. The pond at Bong Substation.I made my way towards Mac Lake. Along the way, there were a few puddling spots consisting of mostly Common Linblues and Tailess Lineblues (Prosotas nora & P.dubiosa) and some Papilionids. A figging tree at Mac Lake attracted a number of nice butterflies such as Kallima incognita? and a Poppinjay (Stibochiona nicea). Penthema darlisa were plentiful at this area, at least more than10 of them feeding on the fallen figs! The neaby firepit and roadside soil also proved popular to the Pierdids and the Papilionids. After a quick lunch at the Mac Lake restaurant (which had the same menu as the HQ restaurant), i revisited a few of the puddling spots around Mac Lake. By 3pm, the sky had turned more overcast and activity was dwindling. I decided to head back to the Park HQ and made it back just before the showers.\r\nClockwise from topleft: Shan Nawab. Great Orange Tip. Popinjay. Kallima cf. incognita.Day 3\r\nWeather: Cloudy, very warm. Darker at 3pm.\r\nFor the third day of the trip, I started at 7.45am which was a little too early. I headed to the restaurant for breakfast and happened to meet a small group from Mandai. I decided to rent a bike (250k VND/day) to venture further into the park. It was a semiautomatic motorcycle with slightly different controls and it took a while for me to get used to it. The first stop was Mac Lake to check out some the sites from the previous day and the only notable addition was a Redspot Duke (Dophla evelina).\r\nBlack-and-white helens, Spangle, Red helens. Penthema darlisa feeding on figs. Lampropteras with a Yellow Gorgon in the background. A typical aggregation of Lycanidids and Pierdids.Further down the road was a guard post which separated the strictly protected area from the rest of the park. The area looked very promising, with puddling spots everywhere along the road but due to time constraints, I skipped most of these. I made a short detour up the Prehistoric Man Cave, where there was a Marbled Map (Cyrestis cocles) and a few flying Junglekings (Thauria lathyi). The parking area also had a couple of puddling spots where I found the cf. Yellow Rajah (Charaxes marmax).\r\nI arrived at Bong Substation at 12.30pm and headed to the restauramt (different menu at last!) for a quick lunch better setting off to the nearby short trail. There were some butterflies along the trail such as the Branded Yamfly and Flat. After the second rest area, I managed to find one of my targets. At least four Jungle Queens were spotted feeding on the sap of a tree. Three of them were Stichophthalma suffusa but the last one should be the rarer Stichophthalma fruhstorferi The sky startred to look very dark and that point and I was rushing down the trail. The brilliant blue of Jungle Glories (Thaumantis diores) stood out in the low light as they flittered around and one posed long enough for me to get a few shots off.\r\nStichophthalma fruhstorferi.Stichophthalma suffusa.At the end of the trail, there was a pond/reservoir where there a few few puddlers despite the weather. Three quarters around the pond, I flushed out a large, yellow butterfly. The crescent shape was distinctive even as it flew into the treeline. Luckily, I spotted another one flapping when I shifted my foot. I managed a few shots of the Yellow Gorgon (Meandrusa payeni) before it also flew off. I left Bong Substation at around 4.45pm and most puddlers had dispersed by then.\r\nDay 4\r\nOn my last day at CPNP, I headed to the Save Vietnam Wildlife Animal Rescue Centre to get a pangolin softtoy (350kVND). I started butterflying proper at 9am at the park’s botanic garden. Centaur oakblues (Arhopala centaurus) were common along the trail but the highlights were the three Jungleking (Thauria lathyi) and an Oakblue (Arhopala aida). Around midway through the trail, I decided to turn back and head to Bong Substation to hopefully get better pictures of the Yellow Gorgon.\r\nI arrived at Bong Substation at 11am and headed straight to the pond. A friendly Common Maplet (Chersonesia risa) was happily puddling on the moist ground towards the pond. At the outlet area, amongst the massive aggregation of Lamproptera spp were two Yellow Gorgons (Meandrusa payeni)! After getting some cleaner improvement shots, I started chasing them to get some open-winged in-flight shots. The pair were very friendly and often landed nearby or at the opposite end of the pond. After more than an hour of chasing them around the pond, I managed some satisfactory shots and headed off to lunch. At the open field where the bungalows are, an Indian Fritillary (Argynnis hyperbius) was found visiting the Bidens sp., a new species for the trip.\r\n\r\nFive Yellow Gorgons in a shot!After lunch, I returned to the same pond to check if there were any new butterflies and found a total of eight Yellow Gorgons (Meandrusa payeni), five on one end of the pond and three on the other. I shot my fill of them before going for some of the other butterflies in the aggregations. I decided to hike up the trail as far as time permits. The start of the trail was productive, with a Blue Begum (Prothoe franck), Scarce Cat’s Eye (Coelites nothis) and a friendly Jungleking (Thauria lathyi). I managed to make do about one third of the trail and had to turn back after shooting a Vietnamese Dark Yellow-banded Flat (Celaenorrhinus vietnamicus). On the way out, I spotted another new butterfly, an Abisara sp. I rode the 35 minutes back to the Park HQ to meet my driver for the 3 hour drive to Ba Vi National Park.\r\nBlue Begum. Scarce Catseye. Jungleking. Vietnamese Dark Yellow-banded Flat.CPNP thoughts\r\nIn hindsight, I would have opted for the fourth class room which should be sufficiently comfortable and a 100k VND/night cheaper but I could not find the pictures online. The accommodations at Mac Lake can also be considered as it is closer to the deeper forest but I found it a little noisy on the first night while walking pass.\r\nFor future trips, it will be more productive to spend more time deeper in the forest. The aggregations in the inner areas had a similar composition to those outside but with a higher abundance. For this trip, I found it to be alright as I needed many of the common puddlers.\r\nMost of the puddling took place along the main road through the park. The traffic could be rather heavy especially on the weekends which spooked the butterflies.\r\nThe park arranged transport felt a little expensive. It might have been possible to arrange it through a tour operator instead.\r\nFood in CPNPBa Vi National Park (21st-23rd June)\r\nBa Vi National Park is about 50km northwest of Hanoi or about 120km north of CPNP. It is a popular hill station owing to its relative proximity to Hanoi. It ranges from about 200m ASL at the entrance to 1300m ASL at the highest peak in the park and offers a different forest type from the lowland forests of CPNP. Most of the accommodations are found at the foothill but there are a few more expensive resorts within the national park itself. I stayed at Bavi Homestead (375k VND/night) which is a 15 minutes walk from the park entrance. The entrance fee is 60k VND/day and an additional 10k if you are riding up.\r\nMy room. Small trail along the route up. Scenary from the peak. Reservoir.\r\n\r\n\r\nBVNP Day 1\r\nWeather: Morning cloudy with periods of sun, clear later.\r\nI started a little late at 9.15am and proceeded to the ticketing office which was around 1km from the accommodations. Similar to the first day at CPNP, I decided to walk as far as my legs would take me. The park entrance was at around 200m ASL and it was a rather gentle slope up the mountain. The start of the road was filled with Lemon Emigrants (Catopsilia pomona), Common Tigers (Danaus genutia) and Euploea spp. A Yellow Flat (Mooreana trichoneura) was the consolation prize for the long walk up. Along the way, there were a few trails leading into the forests that I checked out. The first one had a few Stichophthalma suffusa and Large Fauns (Faunis eumeus) before I was chased out by a dog. Further up the road, there was a trail towards the botanic garden and one for the cave. The cave side had some plantings that attracted Tigers, an Indian Fritillary (Argynnis hyperbius) as well as a few dogfighting Papilio paris. The botanic garden side was more overgrown and had a few interesting butterflies including a Tailed Labyrinth (Neope bhadra). I turned back at the river crossing and headed up to the resort area (400-500m ASL) for lunch. I took the right side towards the Melia Resort and went into a trail along the road. The area had some odonates but only the usual butterflies. I decided to turn back at around 3.45pm and it was an uneventful 2 hour walk down.\r\nDogfighting Paris Peacocks.A friendly Tailed Labyrinth!BVNP Day 2\r\nWeather: cloudy and a little foggy in the morning.\r\nI started the day at around 8.45am and headed to a nearby store to rent a motorcycle (250k VND/day). It was still a little foggy as I rode up to the highest point of BVNP to try and get hilltopping butterflies and more montane species. The road stops at about 1100m ASL and you would have to walk up the last 200m to reach the peaks. I made my way up towards Uncle Ho’s temple (~1300m ASL), the highest peak of the mountain chain. A few Lethe naga and a Lethe sinorix were spotted on the way to the peak. Butterfly activity started picking up at around 11am with the appearance of a few Mixed Punches (Dodona ouida), Commodores (Parasarpa dudu & Sumalia daraxa) and Popinjays (Stibochiona nicea). A new-to-me butterfly was the Purple Sapphire (Heliophorus epicles). I made my way back to the carpark and had lunch in one of the restaurants before going up the second peak. This peak had much less activity, only a Tailed Labyrinth (Neope bhadra).\r\nIndian Fritillary female. Large Faun. Mixed Punch. Spotted Sawtooth.On the way down the mountain, I stopped at few promising areas. The heritage tree trail had a few Spotted Sawtooth (Prioneris thestylis). The Old Church area netted me another Tailed Labyrinth (Neope bhadra) and a Spotted Palmfly (Elymnias malelas). The last trail I visited was the old French camping grounds. A Stichophthalma suffusa, Scarce Red Forester (Lethe distans) and a Black Forester (Lethe vindhya) were found feeding on some fallen fruits. Both Lethe species were new to me. It was around 4.45pm by then and I rolled back down the mountain.\r\nNaga Treebrown. Tailed Red Forester. Black Forester. Scarce Red ForesterBVNP Day 3\r\nWeather: Dark and overcast\r\nThere were heavy rains throughout the night which led to a few power outages. The sky was very cloudy when I woke up and I was not expecting much activity for my last half day of butterflying. I checked out and started wandering around 10am. For this day, I decided to head west. There is a pay-to-enter area that looked promising (150kVND +90k VND to rent a bicycle I think) but given the weather and that I had to return to the hotel at 1pm to meet the taxi driver, I chose to walk around the dam. I netted a few more new species here with a Courtesan (Euripus nyctelius), Golden Birdwing (Troides aeacus) and Common Mime (Papilio clytia) attracted to the Lantanas. Back at the hotel, I found two Redeyes (Matapa cf. aria) hanging around the bamboo grove before I slipped on path :). At least the camera and lens seems fine for now. After a quick lunch, I took a taxi back to Hanoi (750k VND).\r\nA female Great Mormon chilling.BVNP Thoughts\r\nIt was a three hour trip from Cuc Phuong National Park and I arrived slightly after 8pm. Most restaurants and eateries were closed by then and the only place I could find food was a small minimart where I had cup noodles and bananas.\r\nThe first day was rather wasted and I should have headed straight up to the higher elevations. At least it was good exercise.\r\nI got a few new species such as the various Lethe, Tailed Labyrinth (Neope bhadra) and Mixed Punch (Dodona ouida) but overall diversity and abundance of butterflies was not high. Tam Dao National Park might have been a better option though it is quite a distance away.\r\nChill trip food because there are hardly any 7-11s here. Last pic (bun cha) from Hanoi.Numbers and checklist\r\nCurrently I have 127 species identified and some individuals still left at the genus level. The list of sightings can be found on my INaturalist. Help with identification would be greatly appreciated :). A checklist is provided below:\r\n\r\n\r\n\r\nFamily\r\n\r\n\r\nScientific.Name\r\n\r\n\r\nCPNP\r\n\r\n\r\nBVNP\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium agamemnon\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium antiphates\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium doson\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium eurypylus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium macareus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium sarpedon\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nLamproptera curius\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nLamproptera meges\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nMeandrusa payeni\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio bianor\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio clytia\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio demoleus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio helenus\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio memnon\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio memnon agenor\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio nephelus\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio paris\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio polytes\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio protenor\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nTroides aeacus\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nPieridae\r\n\r\n\r\nAppias albina\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nAppias galba\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nAppias indra\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPieridae\r\n\r\n\r\nAppias libythea\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nAppias lyncida\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nPieridae\r\n\r\n\r\nCatopsilia pomona\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPieridae\r\n\r\n\r\nCepora nadina\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nCepora nerissa\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nEurema\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nEurema blanda\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nEurema laeta\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nHebomoia glaucippe\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nIxias pyrene\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nLeptosia nina\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPieridae\r\n\r\n\r\nPierini\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nPieris canidia\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPieridae\r\n\r\n\r\nPrioneris thestylis\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nArgynnis hyperbius\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nAriadne ariadne\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nAthyma\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nAthyma selenophora\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCethosia biblis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCethosia cyane\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCharaxes marmax\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCharaxes bernardus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nChersonesia risa\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCirrochroa tyche\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCoelites nothis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCupha erymanthis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCyrestis cocles\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCyrestis themire\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCyrestis thyodamas\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nDanaus genutia\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nDophla evelina\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nElymnias malelas\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nEuploea\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nEuploea mulciber\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nEuripus nyctelius\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nEuthalia\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nEuthalia eriphylae\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nEuthalia monina\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nFaunis canens\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nFaunis eumeus\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nHestinalis nama\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nHypolimnas bolina\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nHypolimnas misippus\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nIdeopsis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nJunonia almana\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nJunonia atlites\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nJunonia iphita\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nJunonia lemonias\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nKallima inachus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLethe confusa\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLethe distans\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLethe naga\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLethe sinorix\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLethe vindhya\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLexias pardalis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLibythea myrrha\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nMelanitis\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nMelanitis leda\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nModuza procris\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nMycalesis\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nNeope bhadra\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nNeope muirheadii\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nNeptini\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nNeptis\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nPantoporia\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nParantica\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nParantica aglea\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nParantica melaneus\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nParasarpa dudu\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nPenthema darlisa\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nPhalanta alcippe\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nPolyura athamas\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nPolyura nepenthes\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nProthoe franck\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nRohana parisatis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nStibochiona nicea\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nStichophthalma fruhstorferi\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nStichophthalma suffusa\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nSumalia daraxa\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nSymbrenthia lilaea\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nTanaecia\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nTanaecia julii\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nTelinga malsara\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nThaumantis diores\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nThauria lathyi\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nTirumala limniace\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nTirumala septentrionis\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nVagrans\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nVagrans sinha\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nVindula erota\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nYpthima\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nRiodinidae\r\n\r\n\r\nAbisara echerius\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nRiodinidae\r\n\r\n\r\nDodona ouida\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nRiodinidae\r\n\r\n\r\nZemeros flegyas\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nAcytolepis puspa\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nAnthene emolus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nArhopala aida\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nArhopala centaurus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nCatochrysops panormus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nCatochrysops strabo\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nCelastrina lavendularis\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nCuretis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nHeliophorus ila\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nHeliophorus delacouri\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nJamides alecto\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nJamides celeno\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nJamides elpis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nLuthrodes pandava\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nMegisba malaya\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nNacaduba kurava\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nProsotas dubiosa\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nProsotas nora\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nPseudozizeeria maha\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nRapala manea\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nRapala nissa\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nUdara dilecta\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nYasoda tripunctata\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nZeltus amasa\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nBorbo\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nCelaenorrhinini\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nCelaenorrhinus vietnamicus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nGangara thyrsis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nHasora\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nHesperiidae\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nMatapa\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nMooreana trichoneura\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nNotocrypta\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nOdontoptilum angulata\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nParnara\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nPseudocoladenia dan\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nTelicota\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\nNote: Data extracted from inat on 22 July 2023 *A 1 in the table indicates presence at the site\r\nOther stuff & Cost breakdown\r\nList of stuff I brought for the trip\r\nGear:\r\n- Canon R7\r\n- Sigma 150mm f2.8 macro\r\n- Canon 100-400 f/4.5-5.6L II\r\n- Canon Speedlite 600EX & 430EXII\r\n- Canon GP-E2\r\nBreakdown of expenditure for this trip.\r\n\r\n\r\nDate\r\n\r\n\r\nTransport (USD)\r\n\r\n\r\nTransport\r\n\r\n\r\nAccommodations\r\n\r\n\r\nBreakfast\r\n\r\n\r\nLunch\r\n\r\n\r\nDinner\r\n\r\n\r\nEntrance Fee\r\n\r\n\r\nOther\r\n\r\n\r\n17-Jun-23\r\n\r\n\r\n215\r\n\r\n\r\n\r\n\r\n600\r\n\r\n\r\n\r\n\r\n74\r\n\r\n\r\n70\r\n\r\n\r\n60\r\n\r\n\r\n120\r\n\r\n\r\n18-Jun-23\r\n\r\n\r\n\r\n\r\n\r\n\r\n500\r\n\r\n\r\n\r\n\r\n125\r\n\r\n\r\n100\r\n\r\n\r\n\r\n\r\n\r\n\r\n19-Jun-23\r\n\r\n\r\n\r\n\r\n260\r\n\r\n\r\n500\r\n\r\n\r\n30\r\n\r\n\r\n130\r\n\r\n\r\n150\r\n\r\n\r\n\r\n\r\n\r\n\r\n20-Jun-23\r\n\r\n\r\n\r\n\r\n260\r\n\r\n\r\n375\r\n\r\n\r\n\r\n\r\n120\r\n\r\n\r\n30\r\n\r\n\r\n\r\n\r\n350\r\n\r\n\r\n21-Jun-23\r\n\r\n\r\n\r\n\r\n\r\n\r\n375\r\n\r\n\r\n\r\n\r\n90\r\n\r\n\r\n110\r\n\r\n\r\n60\r\n\r\n\r\n1\r\n\r\n\r\n22-Jun-23\r\n\r\n\r\n\r\n\r\n250\r\n\r\n\r\n375\r\n\r\n\r\n\r\n\r\n120\r\n\r\n\r\n130\r\n\r\n\r\n70\r\n\r\n\r\n\r\n\r\n23-Jun-23\r\n\r\n\r\n\r\n\r\n750\r\n\r\n\r\n340\r\n\r\n\r\n\r\n\r\n120\r\n\r\n\r\n80\r\n\r\n\r\n\r\n\r\n\r\n\r\nNote: \r\n\r\n\r\n Values in ’000VND\r\n\r\n\r\nThe 350k VND was for a really cute pangolin plushie from the Save Vietnam Wildlife Rescue Centre. The 450k VND was for a copy of the Butterflies of Vietnam: An Illustrated Checklist. It is rather basic, having plates for only about 60 species but it is a nice souvenir and can join the rest of my bird field guides.\r\nThe pangolin plushieAnd lastly, thanks proofreaders.\r\n\r\n\r\n\r\n",
    "preview": "posts/2023-07-27-north-vietnam-2023/img/Vn2023/gorgon1.jpg",
    "last_modified": "2023-07-27T21:25:17+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome!",
    "author": [
      {
        "name": "Nicholas",
        "url": {}
      }
    ],
    "date": "2023-07-26",
    "categories": [],
    "contents": "\r\nWelcome to my new blog about casual butterfly trips and other related things. Really rusty with R now and unfamiliar with these packages but hopefully it is still helpful.\r\nWhat does NLWS stand for? North, Lest, West, South.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-07-27T21:28:08+08:00",
    "input_file": {}
  }
]
