[
  {
    "path": "posts/2023-10-04-third-anniversary-update/",
    "title": "Third anniversary update",
    "description": "Third anniversary update with graphs!",
    "author": [
      {
        "name": "Nicholas",
        "url": {}
      }
    ],
    "date": "2023-10-04",
    "categories": [],
    "contents": "\r\nYear 3 butterfly summary. Started around 5 Oct 2020. Numbers in the brackets show the change from Year 2.\r\nNumber of lifers: 285 (+20) (includes a most likely Arhopala sublustris and Jewelled grass blue which is not yet on the checklist. Does not include a potential Curetis sperthis IDed by Dr Seow.) The numbers do not really tally with the previous summaries because I have gone back to ID some old photos.\r\nNumber of trips made:\r\nBreakdown of families (Using a modified checklist)\r\nPapilionidae: 14/18 (+1)\r\nPieridae: 15/23\r\nNymphalidae: 83/103 (+5)\r\nRiodinidae: 5/5\r\nLycanidae: 100/120 (+13)\r\nHesperiidae: 62/82 (+4)\r\nLast 5 lifers: Striped black crow, Hoary palmer, Flash Royal, Malayan swift, Jewelled grass blue.\r\nSpecies accumulation by date. Dotted lines to separate years.Sepecies accumulation by trips made. Dotted lines to separate years.Surprises:\r\n1) Black rajah (Charaxes solon) at Rifle Range Link in November 2022. Got drenched for this one.\r\n2) Flash royal (Tarjuria deudorix) at Ridout Road of all places.\r\n3) Black striped crow (Euploea eyndhovii) in my hard disk.\r\nClockwise from topleft: Black rajah, Flash royal, Pitcher blue, Striped black crowSurpassed my Year 3 target of 275 by 10 species. Year 4 target: 290. Definitely plateauing now.\r\nOversea trips in this butterfly year: a week in Central Thailand and a week in north Vietnam. You may find the Vietnam post here.\r\nUpcoming trips: Sabah (next week) and Sri Lanka.\r\nWishlisted butterflies: Banded yeoman, Malay gem, Sky blue, Catapaecilma spp., Tarjuria dominus, Narrow spark, Suffused flash, Storey’s palmer.\r\nThanks Krystal :)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-10-04T16:40:26+08:00",
    "input_file": "third-anniversary-update.knit.md"
  },
  {
    "path": "posts/2023-09-14-second-anniversary-repost/",
    "title": "Second Anniversary Repost",
    "description": "This is a repost of my second butterfly anniversary summary. I originally posted it on Facebook but have decided to keep it here.",
    "author": [
      {
        "name": "Nicholas",
        "url": {}
      }
    ],
    "date": "2023-09-14",
    "categories": [],
    "contents": "\r\nOriginally posted on Facebook on 4 October 2022.\r\nYear 2\r\nYear 2 butterfly summary. Started on 5 Oct 2020 apparently. Numbers in the brackets show the change from Year 1.\r\nNumber of lifers: 256 (+62)\r\nNumber of trips made: 133\r\nBreakdown of families (Using a modified checklist)\r\nPapilionidae: 13/18 (no change)\r\nPieridae: 15/23 (+2)\r\nNymphalidae: 78/103 (+11)\r\nRiodinidae: 5/5 (+2)\r\nLycanidae: 87/115 (+23)\r\nHesperiidae: 58/80 (+24)\r\nNumber of singletons: 35\r\nBiggest day: 61 species, 22 Jan 2022, Pulau Ubin. With Eunice and Sebastian\r\nLast 5 lifers: Paintbrush swift, Indian cupid, Large dart, Yellow flat, Mutal oakblue\r\nSome good additions: Common onyx, White club flitter, Arhopala trogon, Large metallic oakblue, Malayan oakblue, Colon swift & more.\r\nAdditional butts: 15 from Spain. And an uncounted number from Malaysia.\r\nY3 target - 275. Definitely plateauing now.\r\nThanks buttfriends.\r\nDotted lines to separate years.Dotted lines to separate years.\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-09-14T22:12:00+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-09-05-first-anniversary-repost/",
    "title": "First Anniversary Repost",
    "description": "This is a repost of my first butterfly anniversary summary. I originally posted it on Facebook but have decided to keep it here.",
    "author": [
      {
        "name": "Nicholas",
        "url": {}
      }
    ],
    "date": "2023-09-05",
    "categories": [],
    "contents": "\r\nOriginally posted on Facebook on 5 Oct 2021.\r\nBeen butterflying for exactly a year now and recording most of it on scythebill. The records for the first two months were only based on photos but non photographed sightings were included later in most trips. So here’s my progress.\r\nTotal species: 194\r\nBreakdown of families (Using an older checklist)\r\nPapilionidae: 13/18\r\nPieridae: 13/23\r\nNymphalidae: 67/101 +1 ssp for jacintha eggfly\r\nRiodinidae: 3/5\r\nLycanidae: 64/113\r\nHesperiidae: 34/77\r\nSome highlights\r\nVery rares (based on Khew, 2015. Some have probably changed status by now): Malayan jester, silver royal, banded royal, malay staff sergeant, yellow chequered lancer, white tipped baron, angled castor.\r\nMost species in a trip: 51 species from Pulau Ubin on 27 August 2021 with two lifers (angled castor and dark cerulean).\r\nLatest lifer: Banded lineblue\r\nThanks buttfriends\r\nThis graph shows the number of lifers accumalated over the tripsSimilar to the above but in days instead.\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-09-05T22:21:49+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-07-27-north-vietnam-2023/",
    "title": "North Vietnam 2023",
    "description": "Detailing a week-long solo butterfly trip to North Vietnam.",
    "author": [
      {
        "name": "Nicholas",
        "url": {}
      }
    ],
    "date": "2023-07-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nNorth Vietnam 2023 Butterfly trip reportVietnam Overview\r\nCuc Phuong National Park (17th-20th June)\r\nBa Vi National Park (21st-23rd June)\r\nNumbers and checklist\r\nOther stuff & Cost breakdown\r\n\r\n\r\nNorth Vietnam 2023 Butterfly trip report\r\nVietnam Overview\r\nVietnam is home to more than 1200 species of butterflies, a number similar to Thailand and Malaysia. However, it remains a lesser popular destination for Singapore butterfly enthusiasts perhaps due to a lack of easily available information in English. For this trip, I decided to focus on two areas not far from Hanoi, Cuc Phuong National Park (CPNP) and Ba Vi National Park (BVNP). CPNP, Vietnam’s first national park, is typical lowland tropical rainforest. BVNP (altitude ~200-1300m) has a transition towards submontane forests. Even though the two locations are not too far apart, I hoped to find some difference species in the two areas.\r\nWhile planning this trip, I faced some difficulties in finding a comprehensive checklist. Cat Tien National Park in the south had a nice checklist of about 450 species but I could not find a similar checklist for CPNP and BVNP. The closest was a 2003 article which listed the number of butterflies of each genera (total ~400sp) that can be found in CPNP. There are also a few shorter lists by hobbyists and journal articles.\r\nI decided to explore these two parks from 17th to 24th June 2023. The first four days (17th-20th June) were spent in CPNP, the next 2.5 days (21st-23rd June) in BVNP and the last day in Hanoi. My main targets for this trip were the yellow gorgon (Meandrusa payeni), jungle queens (Stichophthalma spp) and Lethe spp. The paths I took for the following days can be found in the maps below.\r\nCuc Phuong National Park (17th-20th June)\r\nDay 1 and arrival\r\nI arranged transport and accommodations at CPNP directly through the park via email. For the rooms, I opted for the third class rooms (500k - 600k VND/night). The process was rather straightforward despite a little language barrier.\r\nAfter a little hiccups, I met the driver at Hanoi’s Noi Bai International Airport at 2.30pm. It was a 3.5 hour drive to CPNP and it was already 6pm by the time I arrived. The trip looked off to a good start with two Penthema darlisas in the park HQ office. Since I had arrivedd a little later than expected, I decided to do a self-guided night walk (a guided nightwalk organised by the park would cost 800k VND). After settling down in my room and a quick dinner at the restaurant, I set off on my walk around the HQ. I managed to find a few Eurema spp, lemons emigrants (Catopsilia pomona) and Penthema darlisa but my search for mammals and herptiles were unsuccessful.\r\n\r\n\r\n\r\n\r\n\r\n\r\nDay 2\r\nWeather: Very warm and humid. Cloudy with occasional showers.\r\nI started the day at 8.15am and decided to explore the trails towards the animal rescue centres. As it was still rather early, butterfly activity was low but I managed to shoot the black-spotted labyrinth (Neope muirheadii), Telinga malsara?, Shan Nawab (Polyura nepenthes) and a few other species.\r\nClockwise from topleft: The third-class room. Cuc Phuong National Park entrance. Towards the park’s interior. The pond at Bong Substation.I made my way towards Mac Lake. Along the way, there were a few puddling spots consisting of mostly Common Linblues and Tailess Lineblues (Prosotas nora & P.dubiosa) and some Papilionids. A figging tree at Mac Lake attracted a number of nice butterflies such as Kallima incognita? and a Poppinjay (Stibochiona nicea). Penthema darlisa were plentiful at this area, at least more than10 of them feeding on the fallen figs! The neaby firepit and roadside soil also proved popular to the Pierdids and the Papilionids. After a quick lunch at the Mac Lake restaurant (which had the same menu as the HQ restaurant), i revisited a few of the puddling spots around Mac Lake. By 3pm, the sky had turned more overcast and activity was dwindling. I decided to head back to the Park HQ and made it back just before the showers.\r\nClockwise from topleft: Shan Nawab. Great Orange Tip. Popinjay. Kallima cf. incognita.Day 3\r\nWeather: Cloudy, very warm. Darker at 3pm.\r\nFor the third day of the trip, I started at 7.45am which was a little too early. I headed to the restaurant for breakfast and happened to meet a small group from Mandai. I decided to rent a bike (250k VND/day) to venture further into the park. It was a semiautomatic motorcycle with slightly different controls and it took a while for me to get used to it. The first stop was Mac Lake to check out some the sites from the previous day and the only notable addition was a Redspot Duke (Dophla evelina).\r\nBlack-and-white helens, Spangle, Red helens. Penthema darlisa feeding on figs. Lampropteras with a Yellow Gorgon in the background. A typical aggregation of Lycanidids and Pierdids.Further down the road was a guard post which separated the strictly protected area from the rest of the park. The area looked very promising, with puddling spots everywhere along the road but due to time constraints, I skipped most of these. I made a short detour up the Prehistoric Man Cave, where there was a Marbled Map (Cyrestis cocles) and a few flying Junglekings (Thauria lathyi). The parking area also had a couple of puddling spots where I found the cf. Yellow Rajah (Charaxes marmax).\r\nI arrived at Bong Substation at 12.30pm and headed to the restauramt (different menu at last!) for a quick lunch better setting off to the nearby short trail. There were some butterflies along the trail such as the Branded Yamfly and Flat. After the second rest area, I managed to find one of my targets. At least four Jungle Queens were spotted feeding on the sap of a tree. Three of them were Stichophthalma suffusa but the last one should be the rarer Stichophthalma fruhstorferi The sky startred to look very dark and that point and I was rushing down the trail. The brilliant blue of Jungle Glories (Thaumantis diores) stood out in the low light as they flittered around and one posed long enough for me to get a few shots off.\r\nStichophthalma fruhstorferi.Stichophthalma suffusa.At the end of the trail, there was a pond/reservoir where there a few few puddlers despite the weather. Three quarters around the pond, I flushed out a large, yellow butterfly. The crescent shape was distinctive even as it flew into the treeline. Luckily, I spotted another one flapping when I shifted my foot. I managed a few shots of the Yellow Gorgon (Meandrusa payeni) before it also flew off. I left Bong Substation at around 4.45pm and most puddlers had dispersed by then.\r\nDay 4\r\nOn my last day at CPNP, I headed to the Save Vietnam Wildlife Animal Rescue Centre to get a pangolin softtoy (350kVND). I started butterflying proper at 9am at the park’s botanic garden. Centaur oakblues (Arhopala centaurus) were common along the trail but the highlights were the three Jungleking (Thauria lathyi) and an Oakblue (Arhopala aida). Around midway through the trail, I decided to turn back and head to Bong Substation to hopefully get better pictures of the Yellow Gorgon.\r\nI arrived at Bong Substation at 11am and headed straight to the pond. A friendly Common Maplet (Chersonesia risa) was happily puddling on the moist ground towards the pond. At the outlet area, amongst the massive aggregation of Lamproptera spp were two Yellow Gorgons (Meandrusa payeni)! After getting some cleaner improvement shots, I started chasing them to get some open-winged in-flight shots. The pair were very friendly and often landed nearby or at the opposite end of the pond. After more than an hour of chasing them around the pond, I managed some satisfactory shots and headed off to lunch. At the open field where the bungalows are, an Indian Fritillary (Argynnis hyperbius) was found visiting the Bidens sp., a new species for the trip.\r\n\r\nFive Yellow Gorgons in a shot!After lunch, I returned to the same pond to check if there were any new butterflies and found a total of eight Yellow Gorgons (Meandrusa payeni), five on one end of the pond and three on the other. I shot my fill of them before going for some of the other butterflies in the aggregations. I decided to hike up the trail as far as time permits. The start of the trail was productive, with a Blue Begum (Prothoe franck), Scarce Cat’s Eye (Coelites nothis) and a friendly Jungleking (Thauria lathyi). I managed to make do about one third of the trail and had to turn back after shooting a Vietnamese Dark Yellow-banded Flat (Celaenorrhinus vietnamicus). On the way out, I spotted another new butterfly, an Abisara sp. I rode the 35 minutes back to the Park HQ to meet my driver for the 3 hour drive to Ba Vi National Park.\r\nBlue Begum. Scarce Catseye. Jungleking. Vietnamese Dark Yellow-banded Flat.CPNP thoughts\r\nIn hindsight, I would have opted for the fourth class room which should be sufficiently comfortable and a 100k VND/night cheaper but I could not find the pictures online. The accommodations at Mac Lake can also be considered as it is closer to the deeper forest but I found it a little noisy on the first night while walking pass.\r\nFor future trips, it will be more productive to spend more time deeper in the forest. The aggregations in the inner areas had a similar composition to those outside but with a higher abundance. For this trip, I found it to be alright as I needed many of the common puddlers.\r\nMost of the puddling took place along the main road through the park. The traffic could be rather heavy especially on the weekends which spooked the butterflies.\r\nThe park arranged transport felt a little expensive. It might have been possible to arrange it through a tour operator instead.\r\nFood in CPNPBa Vi National Park (21st-23rd June)\r\nBa Vi National Park is about 50km northwest of Hanoi or about 120km north of CPNP. It is a popular hill station owing to its relative proximity to Hanoi. It ranges from about 200m ASL at the entrance to 1300m ASL at the highest peak in the park and offers a different forest type from the lowland forests of CPNP. Most of the accommodations are found at the foothill but there are a few more expensive resorts within the national park itself. I stayed at Bavi Homestead (375k VND/night) which is a 15 minutes walk from the park entrance. The entrance fee is 60k VND/day and an additional 10k if you are riding up.\r\nMy room. Small trail along the route up. Scenary from the peak. Reservoir.\r\n\r\n\r\nBVNP Day 1\r\nWeather: Morning cloudy with periods of sun, clear later.\r\nI started a little late at 9.15am and proceeded to the ticketing office which was around 1km from the accommodations. Similar to the first day at CPNP, I decided to walk as far as my legs would take me. The park entrance was at around 200m ASL and it was a rather gentle slope up the mountain. The start of the road was filled with Lemon Emigrants (Catopsilia pomona), Common Tigers (Danaus genutia) and Euploea spp. A Yellow Flat (Mooreana trichoneura) was the consolation prize for the long walk up. Along the way, there were a few trails leading into the forests that I checked out. The first one had a few Stichophthalma suffusa and Large Fauns (Faunis eumeus) before I was chased out by a dog. Further up the road, there was a trail towards the botanic garden and one for the cave. The cave side had some plantings that attracted Tigers, an Indian Fritillary (Argynnis hyperbius) as well as a few dogfighting Papilio paris. The botanic garden side was more overgrown and had a few interesting butterflies including a Tailed Labyrinth (Neope bhadra). I turned back at the river crossing and headed up to the resort area (400-500m ASL) for lunch. I took the right side towards the Melia Resort and went into a trail along the road. The area had some odonates but only the usual butterflies. I decided to turn back at around 3.45pm and it was an uneventful 2 hour walk down.\r\nDogfighting Paris Peacocks.A friendly Tailed Labyrinth!BVNP Day 2\r\nWeather: cloudy and a little foggy in the morning.\r\nI started the day at around 8.45am and headed to a nearby store to rent a motorcycle (250k VND/day). It was still a little foggy as I rode up to the highest point of BVNP to try and get hilltopping butterflies and more montane species. The road stops at about 1100m ASL and you would have to walk up the last 200m to reach the peaks. I made my way up towards Uncle Ho’s temple (~1300m ASL), the highest peak of the mountain chain. A few Lethe naga and a Lethe sinorix were spotted on the way to the peak. Butterfly activity started picking up at around 11am with the appearance of a few Mixed Punches (Dodona ouida), Commodores (Parasarpa dudu & Sumalia daraxa) and Popinjays (Stibochiona nicea). A new-to-me butterfly was the Purple Sapphire (Heliophorus epicles). I made my way back to the carpark and had lunch in one of the restaurants before going up the second peak. This peak had much less activity, only a Tailed Labyrinth (Neope bhadra).\r\nIndian Fritillary female. Large Faun. Mixed Punch. Spotted Sawtooth.On the way down the mountain, I stopped at few promising areas. The heritage tree trail had a few Spotted Sawtooth (Prioneris thestylis). The Old Church area netted me another Tailed Labyrinth (Neope bhadra) and a Spotted Palmfly (Elymnias malelas). The last trail I visited was the old French camping grounds. A Stichophthalma suffusa, Scarce Red Forester (Lethe distans) and a Black Forester (Lethe vindhya) were found feeding on some fallen fruits. Both Lethe species were new to me. It was around 4.45pm by then and I rolled back down the mountain.\r\nNaga Treebrown. Tailed Red Forester. Black Forester. Scarce Red ForesterBVNP Day 3\r\nWeather: Dark and overcast\r\nThere were heavy rains throughout the night which led to a few power outages. The sky was very cloudy when I woke up and I was not expecting much activity for my last half day of butterflying. I checked out and started wandering around 10am. For this day, I decided to head west. There is a pay-to-enter area that looked promising (150kVND +90k VND to rent a bicycle I think) but given the weather and that I had to return to the hotel at 1pm to meet the taxi driver, I chose to walk around the dam. I netted a few more new species here with a Courtesan (Euripus nyctelius), Golden Birdwing (Troides aeacus) and Common Mime (Papilio clytia) attracted to the Lantanas. Back at the hotel, I found two Redeyes (Matapa cf. aria) hanging around the bamboo grove before I slipped on path :). At least the camera and lens seems fine for now. After a quick lunch, I took a taxi back to Hanoi (750k VND).\r\nA female Great Mormon chilling.BVNP Thoughts\r\nIt was a three hour trip from Cuc Phuong National Park and I arrived slightly after 8pm. Most restaurants and eateries were closed by then and the only place I could find food was a small minimart where I had cup noodles and bananas.\r\nThe first day was rather wasted and I should have headed straight up to the higher elevations. At least it was good exercise.\r\nI got a few new species such as the various Lethe, Tailed Labyrinth (Neope bhadra) and Mixed Punch (Dodona ouida) but overall diversity and abundance of butterflies was not high. Tam Dao National Park might have been a better option though it is quite a distance away.\r\nChill trip food because there are hardly any 7-11s here. Last pic (bun cha) from Hanoi.Numbers and checklist\r\nCurrently I have 127 species identified and some individuals still left at the genus level. The list of sightings can be found on my INaturalist. Help with identification would be greatly appreciated :). A checklist is provided below:\r\n\r\n\r\n\r\nFamily\r\n\r\n\r\nScientific.Name\r\n\r\n\r\nCPNP\r\n\r\n\r\nBVNP\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium agamemnon\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium antiphates\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium doson\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium eurypylus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium macareus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nGraphium sarpedon\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nLamproptera curius\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nLamproptera meges\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nMeandrusa payeni\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio bianor\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio clytia\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio demoleus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio helenus\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio memnon\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio memnon agenor\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio nephelus\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio paris\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio polytes\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nPapilio protenor\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPapilionidae\r\n\r\n\r\nTroides aeacus\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nPieridae\r\n\r\n\r\nAppias albina\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nAppias galba\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nAppias indra\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPieridae\r\n\r\n\r\nAppias libythea\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nAppias lyncida\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nPieridae\r\n\r\n\r\nCatopsilia pomona\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPieridae\r\n\r\n\r\nCepora nadina\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nCepora nerissa\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nEurema\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nEurema blanda\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nEurema laeta\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nHebomoia glaucippe\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nIxias pyrene\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nLeptosia nina\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPieridae\r\n\r\n\r\nPierini\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nPieridae\r\n\r\n\r\nPieris canidia\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nPieridae\r\n\r\n\r\nPrioneris thestylis\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nArgynnis hyperbius\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nAriadne ariadne\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nAthyma\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nAthyma selenophora\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCethosia biblis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCethosia cyane\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCharaxes marmax\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCharaxes bernardus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nChersonesia risa\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCirrochroa tyche\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCoelites nothis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCupha erymanthis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCyrestis cocles\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCyrestis themire\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nCyrestis thyodamas\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nDanaus genutia\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nDophla evelina\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nElymnias malelas\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nEuploea\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nEuploea mulciber\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nEuripus nyctelius\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nEuthalia\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nEuthalia eriphylae\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nEuthalia monina\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nFaunis canens\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nFaunis eumeus\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nHestinalis nama\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nHypolimnas bolina\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nHypolimnas misippus\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nIdeopsis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nJunonia almana\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nJunonia atlites\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nJunonia iphita\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nJunonia lemonias\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nKallima inachus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLethe confusa\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLethe distans\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLethe naga\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLethe sinorix\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLethe vindhya\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLexias pardalis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nLibythea myrrha\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nMelanitis\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nMelanitis leda\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nModuza procris\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nMycalesis\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nNeope bhadra\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nNeope muirheadii\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nNeptini\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nNeptis\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nPantoporia\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nParantica\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nParantica aglea\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nParantica melaneus\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nParasarpa dudu\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nPenthema darlisa\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nPhalanta alcippe\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nPolyura athamas\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nPolyura nepenthes\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nProthoe franck\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nRohana parisatis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nStibochiona nicea\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nStichophthalma fruhstorferi\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nStichophthalma suffusa\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nSumalia daraxa\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nSymbrenthia lilaea\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nTanaecia\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nTanaecia julii\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nTelinga malsara\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nThaumantis diores\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nThauria lathyi\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nTirumala limniace\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nTirumala septentrionis\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nVagrans\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nVagrans sinha\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nVindula erota\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nNymphalidae\r\n\r\n\r\nYpthima\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nRiodinidae\r\n\r\n\r\nAbisara echerius\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nRiodinidae\r\n\r\n\r\nDodona ouida\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nRiodinidae\r\n\r\n\r\nZemeros flegyas\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nAcytolepis puspa\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nAnthene emolus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nArhopala aida\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nArhopala centaurus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nCatochrysops panormus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nCatochrysops strabo\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nCelastrina lavendularis\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nCuretis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nHeliophorus ila\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nHeliophorus delacouri\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nJamides alecto\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nJamides celeno\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nJamides elpis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nLuthrodes pandava\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nMegisba malaya\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nNacaduba kurava\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nProsotas dubiosa\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nProsotas nora\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nPseudozizeeria maha\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nRapala manea\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nRapala nissa\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nUdara dilecta\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nYasoda tripunctata\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nLycaenidae\r\n\r\n\r\nZeltus amasa\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nBorbo\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nCelaenorrhinini\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nCelaenorrhinus vietnamicus\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nGangara thyrsis\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nHasora\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nHesperiidae\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nMatapa\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nMooreana trichoneura\r\n\r\n\r\n1\r\n\r\n\r\n1\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nNotocrypta\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nOdontoptilum angulata\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nParnara\r\n\r\n\r\n\r\n\r\n1\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nPseudocoladenia dan\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\nHesperiidae\r\n\r\n\r\nTelicota\r\n\r\n\r\n1\r\n\r\n\r\n\r\n\r\n\r\nNote: Data extracted from inat on 22 July 2023 *A 1 in the table indicates presence at the site\r\nOther stuff & Cost breakdown\r\nList of stuff I brought for the trip\r\nGear:\r\n- Canon R7\r\n- Sigma 150mm f2.8 macro\r\n- Canon 100-400 f/4.5-5.6L II\r\n- Canon Speedlite 600EX & 430EXII\r\n- Canon GP-E2\r\nBreakdown of expenditure for this trip.\r\n\r\n\r\nDate\r\n\r\n\r\nTransport (USD)\r\n\r\n\r\nTransport\r\n\r\n\r\nAccommodations\r\n\r\n\r\nBreakfast\r\n\r\n\r\nLunch\r\n\r\n\r\nDinner\r\n\r\n\r\nEntrance Fee\r\n\r\n\r\nOther\r\n\r\n\r\n17-Jun-23\r\n\r\n\r\n215\r\n\r\n\r\n\r\n\r\n600\r\n\r\n\r\n\r\n\r\n74\r\n\r\n\r\n70\r\n\r\n\r\n60\r\n\r\n\r\n120\r\n\r\n\r\n18-Jun-23\r\n\r\n\r\n\r\n\r\n\r\n\r\n500\r\n\r\n\r\n\r\n\r\n125\r\n\r\n\r\n100\r\n\r\n\r\n\r\n\r\n\r\n\r\n19-Jun-23\r\n\r\n\r\n\r\n\r\n260\r\n\r\n\r\n500\r\n\r\n\r\n30\r\n\r\n\r\n130\r\n\r\n\r\n150\r\n\r\n\r\n\r\n\r\n\r\n\r\n20-Jun-23\r\n\r\n\r\n\r\n\r\n260\r\n\r\n\r\n375\r\n\r\n\r\n\r\n\r\n120\r\n\r\n\r\n30\r\n\r\n\r\n\r\n\r\n350\r\n\r\n\r\n21-Jun-23\r\n\r\n\r\n\r\n\r\n\r\n\r\n375\r\n\r\n\r\n\r\n\r\n90\r\n\r\n\r\n110\r\n\r\n\r\n60\r\n\r\n\r\n1\r\n\r\n\r\n22-Jun-23\r\n\r\n\r\n\r\n\r\n250\r\n\r\n\r\n375\r\n\r\n\r\n\r\n\r\n120\r\n\r\n\r\n130\r\n\r\n\r\n70\r\n\r\n\r\n\r\n\r\n23-Jun-23\r\n\r\n\r\n\r\n\r\n750\r\n\r\n\r\n340\r\n\r\n\r\n\r\n\r\n120\r\n\r\n\r\n80\r\n\r\n\r\n\r\n\r\n\r\n\r\nNote: \r\n\r\n\r\n Values in ’000VND\r\n\r\n\r\nThe 350k VND was for a really cute pangolin plushie from the Save Vietnam Wildlife Rescue Centre. The 450k VND was for a copy of the Butterflies of Vietnam: An Illustrated Checklist. It is rather basic, having plates for only about 60 species but it is a nice souvenir and can join the rest of my bird field guides.\r\nThe pangolin plushieAnd lastly, thanks proofreaders.\r\n\r\n\r\n\r\n",
    "preview": "posts/2023-07-27-north-vietnam-2023/img/Vn2023/gorgon1.jpg",
    "last_modified": "2023-07-27T21:25:17+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome!",
    "author": [
      {
        "name": "Nicholas",
        "url": {}
      }
    ],
    "date": "2023-07-26",
    "categories": [],
    "contents": "\r\nWelcome to my new blog about casual butterfly trips and other related things. Really rusty with R now and unfamiliar with these packages but hopefully it is still helpful.\r\nWhat does NLWS stand for? North, Lest, West, South.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-07-27T21:28:08+08:00",
    "input_file": {}
  }
]
